export default function PrivacyPolicy() {
  return (
    <div className="flex flex-col gap-4 container py-16 px-4 lg:px-16 [&>h1]:text-4xl [&>h1]:font-semibold [&>h2]:text-3xl [&>h2]:font-semibold [&>h3]:text-xl [&>h3]:font-semibold [&>ul>li]:list-disc">
      <h1>Політика Конфіденційності</h1>
      <span>Дата набрання чинності: 12.12.2023 р.</span>
      <h2>1. Вступ</h2>
      <p>Ласкаво просимо на &quot;Дай П&apos;ять&quot;. Ми поважаємо вашу конфіденційність і прагнемо захищати ваші особисті дані. Ця політика конфіденційності описує наші практики збору, використання, розкриття, зберігання та захисту ваших особистих даних.  </p>
      <h2>2. Збір та Використання Інформації</h2>
      <h3>2.1 Особиста Інформація</h3>
      <p>Ми збираємо особисті дані, які ви надаєте нам при поданні заявки на запис. Це включає в себе:</p>
      <ul>
        <li>Ваш номер користувача.</li>
        <li>Інші дані, які ви можете надати у процесі подання заявки.</li>
      </ul>
      <h3>2.2 Використання Вашої Інформації</h3>
      <p>Ми використовуємо зібрану інформацію для:</p>
      <ul>
        <li>Обробки вашої заявки на запис.</li>
        <li>Покращення якості наших послуг.</li>
        <li>Зв&apos;язку з вами, якщо це необхідно.</li>
      </ul>
      <h2>3. Розкриття Інформації</h2>
      <p>Ми не ділимося вашою особистою інформацією з третіми сторонами, за винятком випадків, коли це вимагається за законом або для виконання вашої заявки. </p>
      <h2>3. Безбека</h2>
      <p>Ми вживаємо заходів для забезпечення безпеки вашої особистої інформації від неправомірного доступу, зміни, розкриття або знищення. </p>
      <h2>5. Ваші Права</h2>
      <p>Ви маєте право:</p>
      <ul>
        <li>Запитати доступ до ваших особистих даних.</li>
        <li>Вимагати виправлення невірної або неповної інформації.</li>
        <li>Запитати видалення вашої особистої інформації.</li>
      </ul>
      <h2>6. Зміни в Політиці Конфіденційності</h2>
      <p>Ми можемо час від часу оновлювати цю політику конфіденційності. Зміни будуть опубліковані на нашому веб-сайті &quot;Дай П&apos;ять&quot; з оновленою датою набрання чинності.  </p> 
      <h2>7. Контакти</h2>
      <p>Якщо у вас є питання або зауваження стосовно нашої політики конфіденційності, будь ласка, зв&apos;яжіться з нами за електронною поштою dai5pyatcentre@gmail.com / номером телефону +380931487217 .  </p>
    </div>
  )
}