'use client';
import Image from 'next/image';
import image from '@/public/image/faqImage.png';
import arrowBlue from '@/public/image/icon/ArrowRightBlue.svg';
import imageArticles from '@/public/image/faqImage.png';
import whale from '@/public/image/whale.png';
import author from '@/public/image/articles/author.png';
import Link from 'next/link';
import React from 'react';

export function Articles() {
	const articles = [
		{
			imageLink: imageArticles,
			id: 1,
			title: 'Аутостимуляція',
			description: 'Get all your ducks in a row good optics close the loop and zeitgeist so manage quarterly sales are great to hear for me.',
			article: `Страшне слово для багатьох батьків. Відоме також під назвами «стіми» і «стімінг».

				Аутостимуляція це специфічна поведінка дітей з РАС яка підкріплюється зсередини організму - за рахунок того що вона приносить дитині задоволення, заспокоює її, знімає напругу. Звучить ніби добре - для наших діток. Але ззовні стіми можуть приймати зовсім різноманітні форми - це і махи руками, і стрибки на місці, і вокалізації, а також такі неприємні як облизування предметів, обгризання нігтів, колупання в носі і т.д.
				
				Тобто дуже часто стіми залишаються табуйованими лише через те, що виглядать соціально неприйнятно.
				
				<b>В якому випадку можна зупиняти/корегувати стіми?</b> На мою думку це:- якщо аутостимуляція заважає благополуччю дитини - тобто поведінка виглядає дуже неприйнятно і шанси налагодити соціальні контакти падають, дитина стає «ізгоєм»- коли стіми заважають якійсь діяльності - навчанню, самообслуговуванню, і тд- коли стіми напряму загрожують безпеці дитини - наприклад облизування брудних речей на вулиці призводить до частих кишкових інфекцій. В інших випадках - на мою думку - стіми треба залишити, як одне з небагатьох речей що дійсно заспокоюють/радують дитину.
				
				В самих стінах нема нічого поганого, як би вони нас не дратували 😄 Поки вони не заважають життю дитини.`,
			imageTitle: whale,
			company: 'Company 1',
			details: [
				{
					author: 'Марія Лежньова',
					authorImage: author,
					authorTitle: 'Засновник центру Дай Пʼять  АБА Терапевт',
					dataCreate: '01.08.2000',
				},
			],
		},
		{
			imageLink: imageArticles,
			id: 2,
			title: 'Аутостимуляція',
			description: 'Get all your ducks in a row good optics close the loop and zeitgeist so manage quarterly sales are great to hear for me.',
			article: `Страшне слово для багатьох батьків. Відоме також під назвами «стіми» і «стімінг».

				Аутостимуляція це специфічна поведінка дітей з РАС яка підкріплюється зсередини організму - за рахунок того що вона приносить дитині задоволення, заспокоює її, знімає напругу. Звучить ніби добре - для наших діток. Але ззовні стіми можуть приймати зовсім різноманітні форми - це і махи руками, і стрибки на місці, і вокалізації, а також такі неприємні як облизування предметів, обгризання нігтів, колупання в носі і т.д.
				
				Тобто дуже часто стіми залишаються табуйованими лише через те, що виглядать соціально неприйнятно.
				
				<b>В якому випадку можна зупиняти/корегувати стіми?</b> На мою думку це:- якщо аутостимуляція заважає благополуччю дитини - тобто поведінка виглядає дуже неприйнятно і шанси налагодити соціальні контакти падають, дитина стає «ізгоєм»- коли стіми заважають якійсь діяльності - навчанню, самообслуговуванню, і тд- коли стіми напряму загрожують безпеці дитини - наприклад облизування брудних речей на вулиці призводить до частих кишкових інфекцій. В інших випадках - на мою думку - стіми треба залишити, як одне з небагатьох речей що дійсно заспокоюють/радують дитину.
				
				В самих стінах нема нічого поганого, як би вони нас не дратували 😄 Поки вони не заважають життю дитини.`,
			imageTitle: whale,
			company: 'Company 1',
			details: [
				{
					author: 'Марія Лежньова',
					authorImage: author,
					authorTitle: 'Засновник центру Дай Пʼять  АБА Терапевт',
					dataCreate: '01.08.2000',
				},
			],
		},
		{
			imageLink: imageArticles,
			id: 3,
			title: 'Аутостимуляція',
			description:
				'I’m always trying to think of new and interesting business ideas. I generally try to come up with ideas I’m always trying to think of new and interesting business ideas. I generally try to come up with ideas...',
			article: `Страшне слово для багатьох батьків. Відоме також під назвами «стіми» і «стімінг».

				Аутостимуляція це специфічна поведінка дітей з РАС яка підкріплюється зсередини організму - за рахунок того що вона приносить дитині задоволення, заспокоює її, знімає напругу. Звучить ніби добре - для наших діток. Але ззовні стіми можуть приймати зовсім різноманітні форми - це і махи руками, і стрибки на місці, і вокалізації, а також такі неприємні як облизування предметів, обгризання нігтів, колупання в носі і т.д.
				
				Тобто дуже часто стіми залишаються табуйованими лише через те, що виглядать соціально неприйнятно.
				
				<b>В якому випадку можна зупиняти/корегувати стіми?</b> На мою думку це:- якщо аутостимуляція заважає благополуччю дитини - тобто поведінка виглядає дуже неприйнятно і шанси налагодити соціальні контакти падають, дитина стає «ізгоєм»- коли стіми заважають якійсь діяльності - навчанню, самообслуговуванню, і тд- коли стіми напряму загрожують безпеці дитини - наприклад облизування брудних речей на вулиці призводить до частих кишкових інфекцій. В інших випадках - на мою думку - стіми треба залишити, як одне з небагатьох речей що дійсно заспокоюють/радують дитину.
				
				В самих стінах нема нічого поганого, як би вони нас не дратували 😄 Поки вони не заважають життю дитини.`,
			imageTitle: whale,
			company: 'Company 1',
			details: [
				{
					author: 'Марія Лежньова',
					authorImage: author,
					authorTitle: 'Засновник центру Дай Пʼять  АБА Терапевт',
					dataCreate: '01.08.2000',
				},
			],
		},
		{
			imageLink: imageArticles,
			id: 4,
			title: 'Аутостимуляція',
			description:
				'I’m always trying to think of new and interesting business ideas. I generally try to come up with ideas I’m always trying to think of new and interesting business ideas. I generally try to come up with ideas...',
			article: `Страшне слово для багатьох батьків. Відоме також під назвами «стіми» і «стімінг».

				Аутостимуляція це специфічна поведінка дітей з РАС яка підкріплюється зсередини організму - за рахунок того що вона приносить дитині задоволення, заспокоює її, знімає напругу. Звучить ніби добре - для наших діток. Але ззовні стіми можуть приймати зовсім різноманітні форми - це і махи руками, і стрибки на місці, і вокалізації, а також такі неприємні як облизування предметів, обгризання нігтів, колупання в носі і т.д.
				
				Тобто дуже часто стіми залишаються табуйованими лише через те, що виглядать соціально неприйнятно.
				
				<b>В якому випадку можна зупиняти/корегувати стіми?</b> На мою думку це:- якщо аутостимуляція заважає благополуччю дитини - тобто поведінка виглядає дуже неприйнятно і шанси налагодити соціальні контакти падають, дитина стає «ізгоєм»- коли стіми заважають якійсь діяльності - навчанню, самообслуговуванню, і тд- коли стіми напряму загрожують безпеці дитини - наприклад облизування брудних речей на вулиці призводить до частих кишкових інфекцій. В інших випадках - на мою думку - стіми треба залишити, як одне з небагатьох речей що дійсно заспокоюють/радують дитину.
				
				В самих стінах нема нічого поганого, як би вони нас не дратували 😄 Поки вони не заважають життю дитини.`,
			imageTitle: whale,
			company: 'Company 2',
			details: [
				{
					author: 'Марія Лежньова',
					authorImage: author,
					authorTitle: 'Засновник центру Дай Пʼять  АБА Терапевт',
					dataCreate: '01.08.2000',
				},
			],
		},
		{
			imageLink: imageArticles,
			id: 5,
			title: 'Аутостимуляція',
			description:
				'I’m always trying to think of new and interesting business ideas. I generally try to come up with ideas I’m always trying to think of new and interesting business ideas. I generally try to come up with ideas...',
			article: `Страшне слово для багатьох батьків. Відоме також під назвами «стіми» і «стімінг».

				Аутостимуляція це специфічна поведінка дітей з РАС яка підкріплюється зсередини організму - за рахунок того що вона приносить дитині задоволення, заспокоює її, знімає напругу. Звучить ніби добре - для наших діток. Але ззовні стіми можуть приймати зовсім різноманітні форми - це і махи руками, і стрибки на місці, і вокалізації, а також такі неприємні як облизування предметів, обгризання нігтів, колупання в носі і т.д.
				
				Тобто дуже часто стіми залишаються табуйованими лише через те, що виглядать соціально неприйнятно.
				
				<b>В якому випадку можна зупиняти/корегувати стіми?</b> На мою думку це:- якщо аутостимуляція заважає благополуччю дитини - тобто поведінка виглядає дуже неприйнятно і шанси налагодити соціальні контакти падають, дитина стає «ізгоєм»- коли стіми заважають якійсь діяльності - навчанню, самообслуговуванню, і тд- коли стіми напряму загрожують безпеці дитини - наприклад облизування брудних речей на вулиці призводить до частих кишкових інфекцій. В інших випадках - на мою думку - стіми треба залишити, як одне з небагатьох речей що дійсно заспокоюють/радують дитину.
				
				В самих стінах нема нічого поганого, як би вони нас не дратували 😄 Поки вони не заважають життю дитини.`,
			imageTitle: whale,
			company: 'Company 2',
			details: [
				{
					author: 'Марія Лежньова',
					authorImage: author,
					authorTitle: 'Засновник центру Дай Пʼять  АБА Терапевт',
					dataCreate: '01.08.2000',
				},
			],
		},
		{
			imageLink: imageArticles,
			id: 6,
			title: 'Аутостимуляція',
			description:
				'I’m always trying to think of new and interesting business ideas. I generally try to come up with ideas I’m always trying to think of new and interesting business ideas. I generally try to come up with ideas...',
			article: `Страшне слово для багатьох батьків. Відоме також під назвами «стіми» і «стімінг».

				Аутостимуляція це специфічна поведінка дітей з РАС яка підкріплюється зсередини організму - за рахунок того що вона приносить дитині задоволення, заспокоює її, знімає напругу. Звучить ніби добре - для наших діток. Але ззовні стіми можуть приймати зовсім різноманітні форми - це і махи руками, і стрибки на місці, і вокалізації, а також такі неприємні як облизування предметів, обгризання нігтів, колупання в носі і т.д.
				
				Тобто дуже часто стіми залишаються табуйованими лише через те, що виглядать соціально неприйнятно.
				
				<b>В якому випадку можна зупиняти/корегувати стіми?</b> На мою думку це:- якщо аутостимуляція заважає благополуччю дитини - тобто поведінка виглядає дуже неприйнятно і шанси налагодити соціальні контакти падають, дитина стає «ізгоєм»- коли стіми заважають якійсь діяльності - навчанню, самообслуговуванню, і тд- коли стіми напряму загрожують безпеці дитини - наприклад облизування брудних речей на вулиці призводить до частих кишкових інфекцій. В інших випадках - на мою думку - стіми треба залишити, як одне з небагатьох речей що дійсно заспокоюють/радують дитину.
				
				В самих стінах нема нічого поганого, як би вони нас не дратували 😄 Поки вони не заважають життю дитини.`,
			imageTitle: whale,
			company: 'Company 3',
			details: [
				{
					author: 'Марія Лежньова',
					authorImage: author,
					authorTitle: 'Засновник центру Дай Пʼять  АБА Терапевт',
					dataCreate: '01.08.2000',
				},
			],
		},
		{
			imageLink: imageArticles,
			id: 7,
			title: 'Аутостимуляція',
			description:
				'I’m always trying to think of new and interesting business ideas. I generally try to come up with ideas I’m always trying to think of new and interesting business ideas. I generally try to come up with ideas...',
			article: `Страшне слово для багатьох батьків. Відоме також під назвами «стіми» і «стімінг».

				Аутостимуляція це специфічна поведінка дітей з РАС яка підкріплюється зсередини організму - за рахунок того що вона приносить дитині задоволення, заспокоює її, знімає напругу. Звучить ніби добре - для наших діток. Але ззовні стіми можуть приймати зовсім різноманітні форми - це і махи руками, і стрибки на місці, і вокалізації, а також такі неприємні як облизування предметів, обгризання нігтів, колупання в носі і т.д.
				
				Тобто дуже часто стіми залишаються табуйованими лише через те, що виглядать соціально неприйнятно.
				
				<b>В якому випадку можна зупиняти/корегувати стіми?</b> На мою думку це:- якщо аутостимуляція заважає благополуччю дитини - тобто поведінка виглядає дуже неприйнятно і шанси налагодити соціальні контакти падають, дитина стає «ізгоєм»- коли стіми заважають якійсь діяльності - навчанню, самообслуговуванню, і тд- коли стіми напряму загрожують безпеці дитини - наприклад облизування брудних речей на вулиці призводить до частих кишкових інфекцій. В інших випадках - на мою думку - стіми треба залишити, як одне з небагатьох речей що дійсно заспокоюють/радують дитину.
				
				В самих стінах нема нічого поганого, як би вони нас не дратували 😄 Поки вони не заважають життю дитини.`,
			imageTitle: whale,
			company: 'Company 4',
			details: [
				{
					author: 'Марія Лежньова',
					authorImage: author,
					authorTitle: 'Засновник центру Дай Пʼять  АБА Терапевт',
					dataCreate: '01.08.2000',
				},
			],
		},
		{
			imageLink: imageArticles,
			title: 'Аутостимуляція',
			description:
				'I’m always trying to think of new and interesting business ideas. I generally try to come up with ideas I’m always trying to think of new and interesting business ideas. I generally try to come up with ideas...',
			article: `Страшне слово для багатьох батьків. Відоме також під назвами «стіми» і «стімінг».

				Аутостимуляція це специфічна поведінка дітей з РАС яка підкріплюється зсередини організму - за рахунок того що вона приносить дитині задоволення, заспокоює її, знімає напругу. Звучить ніби добре - для наших діток. Але ззовні стіми можуть приймати зовсім різноманітні форми - це і махи руками, і стрибки на місці, і вокалізації, а також такі неприємні як облизування предметів, обгризання нігтів, колупання в носі і т.д.
				
				Тобто дуже часто стіми залишаються табуйованими лише через те, що виглядать соціально неприйнятно.
				
				<b>В якому випадку можна зупиняти/корегувати стіми?</b> На мою думку це:- якщо аутостимуляція заважає благополуччю дитини - тобто поведінка виглядає дуже неприйнятно і шанси налагодити соціальні контакти падають, дитина стає «ізгоєм»- коли стіми заважають якійсь діяльності - навчанню, самообслуговуванню, і тд- коли стіми напряму загрожують безпеці дитини - наприклад облизування брудних речей на вулиці призводить до частих кишкових інфекцій. В інших випадках - на мою думку - стіми треба залишити, як одне з небагатьох речей що дійсно заспокоюють/радують дитину.
				
				В самих стінах нема нічого поганого, як би вони нас не дратували 😄 Поки вони не заважають життю дитини.`,
			imageTitle: whale,
			company: 'Company 1',
			details: [
				{
					author: 'Марія Лежньова',
					authorImage: author,
					authorTitle: 'Засновник центру Дай Пʼять  АБА Терапевт',
					dataCreate: '01.08.2000',
				},
			],
		},
	];
	return (
		<section className="px-4 bg-[#F3F6FA] rounded-[150px] flex justify-center flex-col pt-[100px] pb-[147px] lg:py-[150px] lg:px-[100px]">
			<div className={'lg:gap-4 gap-[14px] flex justify-center items-center flex-col'}>
				<span className="font-bold lg:text-base text-xs text-customBlue uppercase">Що почитати?</span>
				<h4 className="lg:text-custom32 text-xl font-bold text-[#2A333C] mt-4 mb-12">Ми написали для вас цікаві статті</h4>
			</div>
			<div className={'md:grid md:grid-cols-2 gap-8 flex flex-col items-center md:flex-none'}>
				{articles.slice(0, 4).map((item, index) => (
					<figure
						className={'flex flex-col md:flex-row gap-4'}
						key={index}
					>
						<div className={'bg-white p-4 rounded-3xl w-[343px] md:w-full'}>
							<Image
								src={item.imageLink}
								alt={'img'}
								className={'object-cover md:w-full md:h-full h-[258px] w-[319px]'}
							/>
						</div>
						<figcaption className={'flex justify-center items-start flex-col max-w-[300px]'}>
							<h6 className={'text-xl font-medium mb-3 text-[#2A333C]'}>{item.title}</h6>
							<p className={'lg:text-sm text-xs text-[#2A333C] opacity-70 max-w-[350px] lg:max-w-none h-[60px] line-clamp-3'}>
								{item.description}
							</p>
							<button className={'h-[38px] bg-customBlueLight mt-6 w-full lg:w-[182px] flex items-center justify-center rounded-[65px] gap-3'}>
								<span className="text-customBlue text-sm">Read</span>
								<Image
									src={arrowBlue}
									width={18}
									height={18}
									alt={'icon'}
								/>
							</button>
						</figcaption>
					</figure>
				))}
			</div>
		</section>
	);
}
